-- Напишите запрос, который выведет все столбцы с данными из таблицы movies


-- Напишите запрос, который выведет название фильма, его жанр и год выпуска


-- Напишите запрос, который выведет название фильма, но переименуйте столбец на Titles


-- Напишите запрос, который выведет уникальные названия жанров

-- Напишите запрос, который выведет все столбцы из таблицы movies, при условии что рейтинг фильмов меньше 5


--Исправьте предыдущий запрос, чтобы выводились все столбцы из таблицы movies, при условии что год выпуска больше 2014


--Напишите запрос, который выведет только названия фильмов, при условии, что у них рейтинг заполнен


--Исправьте предыдущий запрос так, чтобы выводились названия фильмов, у которых рейтинг не заполнен


--Напишите запрос, который выведет все данные из таблицы movies для тех фильмов, которые были выпущены 
--в период между 1990 и 1999 годами включительно.


--Напишите запрос, который выведет все данные из таблицы movies для тех фильмов, первая буква названия которых
--лежит в промежутке между буквами алфавита A и J. Отсортируйте результат по названию фильма в алфавитном порядке


--Напишите запрос, который выведет все данные из таблицы movies для фильмов c жанром romance, которые были выпущены 
--в период между 1990 и 1999 годами включительно.	


--Напишите запрос, который выведет все данные из таблицы movies для фильмов c рейтингом больше 8, которые были выпущены 
--в период между 1970 и 1979 годами включительно.


--Напишите запрос, который выведет все данные из таблицы movies для фильмов c жанром horror, которые были выпущены 
--ранее 1985 года не включая этот год


--Напишите запрос, который выведет все данные из таблицы movies для фильмов либо c жанром action, либо те, 
--которые были выпущены позже 2014 года, не включая этот год. Отсортируйте по жанру в алфавитном порядке


--Напишите запрос, который выведет все данные из таблицы movies для фильмов либо c жанром romance, 
--либо c жанром comedy. Отсортируйте результат по названию жанра в обратном алфавитному порядку


--Напишите запрос, который выведет все данные из таблицы movies о топ-3 фильмах с наибольшим рейтингом.
--Напишите запрос, который выведет все данные из таблицы movies о топ-3 фильмах с наибольшим рейтингом.
--Не включайте те фильмы, у которых рейтинг отсутствует


--Найдите количество девочек, которым было дано имя Lillian. Выведите год, когда было дано имя, и количество 


--Выведите имя ребенка, пол, и количество раз, когда было дано данное имя в 1880 году.
--Отсортируйте результат по количеству по убыванию и выведите только 10 записей.

	
--Выведите все данные о ресторанах с японской (Japanese) кухней с категорией цен = '$$' 


--Выведите данные о ресторанах, по которым нет оценки здоровья


--Напишите запрос, который вывод нзвание статьи и её издателя. Отсортируйте результа по названию статьи в порядке возростания


--Посчитать количество записей в таблице fake_apps

	
--Посчитать количество бесплатных приложений в таблице fake_apps


--Посчитайте сумму всех загрузок приложений в таблице fake_apps


--Посчитайте максимальное, минимальное и среднее количество загрузок приложений в таблице fake_apps


--Выведите название приложения, его цену в том виде, какая она есть и цену, округлённую до целого числа
;	

--Найдите среднюю цену на все приложения и результат округлите до двух знаков	


--Выведите средний рейтинг кинофильмов в разбивке по годам выпуска из таблицы movies.
--Результат отсортируйте по году выпуска в порядке возростания



--Напишите запрос, который позволяет нам посчитать количество приложений с отдельно взятой ценой у нас имеется в таблице fake_apps,
--при условии, что количество загрузок больше 20000

--Напишите запрос, который посчитает сумму загрузок по каждой категории приложений



--Напишите запрос, который посчитает нам количество названий фильмов в разбивке по рейтинге, 
--при этом рейтинг должен быть округлен до целого числа. Результат отсортируйте по округлённому рейтингу



--Напишите запрос, который найдет среднее количество загрузок приложений в разбивке в категориям,
--при этом каждая категория отображается в разбивке по цене

	
--Напишите запрос, который посчитает нам количество названий фильмов в разбивке по годам выпуска, 
--при этом каждый год будет отображается в разбивке по жанру. Выведите только те фильмы, количество которых
--больше 10 (не включая 10). Результат отсортируйте по году выпуска в порядке убывания

















